eisup_2019_docmng_integration/src/AccumulationRegisters/ПартииТоваровНаСкладахБухгалтерскийУчет/ПартииТоваровНаСкладахБухгалтерскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПартииТоваровНаСкладахБухгалтерскийУчет</name>
  <comment>(Регл)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КорСчет</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКорСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартий</name>
    <comment>Регламентный документ, сформировавший движения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийПартииТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвиженияПериод</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <comment>Дата формирования проводки регламентной процедурой</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегламентнойОперации</name>
    <type>
      <types>EnumRef.ВидыРегламентныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиСписанныхТоваров</name>
    <comment>Индекс строки списанных товаров</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОприходования</name>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
      <types>DocumentRef.ВозвратМатериаловИзЭксплуатации</types>
      <types>DocumentRef.ПоступлениеТоваровУслугВНТТ</types>
      <types>DocumentRef.ВозвратПереданныхТоваров</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>DocumentRef.ПоступлениеТоваровИзПереработки</types>
      <types>DocumentRef.ОприходованиеМатериаловИзПроизводства</types>
      <types>DocumentRef.КомплектацияНоменклатуры</types>
      <types>DocumentRef.АвансовыйОтчет</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>CatalogRef.Качество</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/ПартииТоваровНаСкладахБухгалтерскийУчет/RecordSetModule.bsl
Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

// Выполняет приход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьПриход() Экспорт

	ttk_ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Приход);

КонецПроцедуры // ВыполнитьПриход()

// Выполняет расход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьРасход() Экспорт

	ttk_ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Расход);

КонецПроцедуры // ВыполнитьРасход()

// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения() Экспорт

	Загрузить(мТаблицаДвижений);

КонецПроцедуры // ВыполнитьДвижения()

//АБС Коломиец+
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если мТаблицаДвижений <> Неопределено  
	   И мТаблицаДвижений.Количество() > 0 Тогда
	   
		ДатаКонтроляПриход = Константы.абс_ДатаКонтроляСчетовНоменклатурыПриход.Получить();
		ДатаКонтроляРасход = Константы.абс_ДатаКонтроляСчетовНоменклатурыРасход.Получить();
		
		Если (ДатаКонтроляПриход <> '00010101' И мПериод >= ДатаКонтроляПриход) 
			Или (ДатаКонтроляРасход <> '00010101' И мПериод >= ДатаКонтроляРасход) Тогда
			
			РезПроверки = ПроверитьЗаполнениеСчетУчетаНоменклатуры(ДатаКонтроляПриход, ДатаКонтроляРасход);		
			
			Если РезПроверки Тогда
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	//АБС ВСТАВКА 47248  28.10.2014 12:06:22  Манжела
	ДатаОчисткиДокументаОснованияПоПартиямБУНУ = Константы.абс_ДатаОчисткиДокументаОснованияПоПартиямБУНУ.Получить();
	МассивСчетаПоСредней      = абс_СлужебныеФункции.ПолучитьСчетаУчетаНоменклатурыПоСредней();
	
	Если ЭтотОбъект.Количество()>0 И ДатаОчисткиДокументаОснованияПоПартиямБУНУ <> '00010101' Тогда
		Для Каждого ЗаписьНабора Из ЭтотОбъект Цикл
			Если ЗаписьНабора.Период>ДатаОчисткиДокументаОснованияПоПартиямБУНУ И МассивСчетаПоСредней.Найти(ЗаписьНабора.СчетУчета.Код)<>Неопределено И ЗаписьНабора.Организация=ПараметрыСеанса.абс_НастройкиСистемы.ОрганизацияКТТК Тогда 
				ЗаписьНабора.ДокументОприходования = Неопределено;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли; 
	//АБС ВСТАВКА 47248 КОНЕЦ

	
КонецПроцедуры

Функция ПроверитьЗаполнениеСчетУчетаНоменклатуры(ДатаКонтроляПриход, ДатаКонтроляРасход)
	
	Отказ = Ложь;
	
	Если ПараметрыСеанса.абс_ПользовательДЗО Тогда //абсо
		Возврат Отказ;
	КонецЕсли;
	
	МассивСчетаПартионныйУчет = абс_СлужебныеФункции.ПолучитьСчетаУчетаНоменклатурыПоПартиям();
	МассивСчетаПоСредней      = абс_СлужебныеФункции.ПолучитьСчетаУчетаНоменклатурыПоСредней();
	
	Если (ДатаКонтроляПриход <> '00010101' И мПериод >= ДатаКонтроляПриход) Тогда 
		
		Для Каждого Движение Из мТаблицаДвижений Цикл
			Если  Движение.ВидДвижения = ВидДвиженияНакопления.Приход 
				И ЗначениеЗаполнено(Движение.Номенклатура) Тогда
				СтруктураСчетовУчета = абс_СлужебныеФункции.ПолучитьСчетаУчетаНоменклатурыИзРегистраСведений(Движение.Организация,Движение.Номенклатура,Движение.Склад);
				Если МассивСчетаПартионныйУчет.Найти(Движение.СчетУчета.Код) <> Неопределено И Не СтруктураСчетовУчета.ПоПартиям Тогда
					Сообщить("Строка " + Строка(Движение.НомерСтроки) + ": Указан некорректный счет учета БУ " + Строка(Движение.СчетУчета) + " (партионный учет). По номенклатуре " + Строка(Движение.Номенклатура) + " не ведется учет по партиям", СтатусСообщения.Внимание);
					Отказ = Истина;
				ИначеЕсли МассивСчетаПоСредней.Найти(Движение.СчетУчета.Код) <> Неопределено И Не СтруктураСчетовУчета.ПоСредней Тогда
					Сообщить("Строка " + Строка(Движение.НомерСтроки) + ": Указан некорректный счет учета БУ " + Строка(Движение.СчетУчета) + " (учет по средней себестоимости). По номенклатуре " + Строка(Движение.Номенклатура) + " не ведется учет по средней", СтатусСообщения.Внимание);
					Отказ = Истина;			
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если (ДатаКонтроляРасход <> '00010101' И мПериод >= ДатаКонтроляРасход) Тогда 
		
		Для Каждого Движение Из мТаблицаДвижений Цикл
			Если  Движение.ВидДвижения = ВидДвиженияНакопления.Расход 
				И ЗначениеЗаполнено(Движение.Номенклатура) Тогда
				СтруктураСчетовУчета = абс_СлужебныеФункции.ПолучитьСчетаУчетаНоменклатурыИзРегистраСведений(Движение.Организация,Движение.Номенклатура,Движение.Склад);
				Если МассивСчетаПартионныйУчет.Найти(Движение.СчетУчета.Код) <> Неопределено И Не СтруктураСчетовУчета.ПоПартиям Тогда
					Сообщить("Строка " + Строка(Движение.НомерСтроки) + ": Указан некорректный счет учета БУ " + Строка(Движение.СчетУчета) + " (партионный учет). По номенклатуре " + Строка(Движение.Номенклатура) + " не ведется учет по партиям", СтатусСообщения.Внимание);
					Отказ = Истина;
				ИначеЕсли МассивСчетаПоСредней.Найти(Движение.СчетУчета.Код) <> Неопределено И Не СтруктураСчетовУчета.ПоСредней Тогда
					Сообщить("Строка " + Строка(Движение.НомерСтроки) + ": Указан некорректный счет учета БУ " + Строка(Движение.СчетУчета) + " (учет по средней себестоимости). По номенклатуре " + Строка(Движение.Номенклатура) + " не ведется учет по средней", СтатусСообщения.Внимание);
					Отказ = Истина;			
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции
//АБС Коломиец-
